{
  "main.introduction": "Un fullstack Developer con mas de 3 años de experiencia desarrollando software, liderando equipos de desarrollo, implementando nuevas tecnologias y dando asesoramiento tecnico a equipos de TI",
  "main.greeting": "¡Hola! Yo soy",
  "main.button": "Descargar CV",
  "link.home": "Inicio",
  "link.contact": "Contacto",
  "short.information.1": "Soy un desarrollador de software por pasión, vocación y profesión",
  "short.information.2": "Me encanta aprender y compartir conocimiento",
  "short.information.3": "Amo trabajar en ambientes agiles donde puedo crecer junto al equipo",
  "short.information.4": "Me gusta ayudar a las personas a entrar al mundo del desarrollo",
  "short.information.5": "Suelo escribir y hacer videos sobre tecnología en mi tiempo libre",
  "short.experience.title": "Experiencia",
  "short.experience.pamer.desc": "\nComo parte del laboratorio de innovación CREEK12 en Pamer. Estoy encargado de:\n- Desarrollar software tanto del lado del servidor como el cliente\n- Hacer software guiandome de los principios SOLID\n- Ser parte de la toma de decisiones de la arquitectura del software\n\nUso tecnologias como:\n- NestJS en el Backend\n- NextJS + Tailwind + TS en el Frontend\n- ESlint + Prettier + Jest + Cypress en el Testing\n- AWS CDK + AWS App Runner + AWS S3\n- Github + Github Actions para el manejo de versiones y CI/CD",
  "short.experience.pamer.title": "Desarrollador de software en Pamer",
  "short.experience.pamer.date": "Jul 2021 - Actualidad (4 meses)",
  "short.experience.cedhinfo.desc": "\nComo lider de tecnologia en Cedhinfo. Estuve encargado de:\n      - Traducir los requerimientos del stakeholder hacia el equipo de desarrollo\n      - Dar guia tecnica en cuanto a practicas de desarrollo para un mejor producto\n      - Mentoria y capacitacion al equipo de desarrollo tanto front como backend\n      - Revision continua de las metas del producto\n      - Y dar reportes del avance de los proyectos\n\n      Todo manejado con un stack de:\n      - Express\n      - Vue\n      - Github",
  "short.experience.cedhinfo.title": "Lider de tecnologia en Cedhinfo",
  "short.experience.cedhinfo.date": "Ene 2021 - Jul 2021 (7 meses)",
  "short.experience.smiledu.desc": "\nComo parte del equipo de desarrollo de Smiledu. Estuve encargado de:\n      - Liderar de uno de los módulos principales del proyecto\n      - Gestionar a un grupo de personas para llegar a metas establecidas\n      - Contribuir a definir los estandares de codigo tanto el Frontend como Backend.\n      - Tambien me vi involucrado en el proceso de prueba, selección, capacitación e inducción de los nuevos integrantes que entrarian a mi area\n\n      Con un stack conformado por:\n      - Angular + Angular Material\n      - Express\n      - PostgreSQL\n      - AWS Lambda + AWS RDS + AWS S3",
  "short.experience.smiledu.title": "Desarrollador de fullstack en Smiledu",
  "short.experience.smiledu.date": "Dic 2018 - Dic 2020 (2 años y 1 mes)",
  "footer.contact": "Como te puedo ayudar? Contactame!",
  "footer.contact.text": "Tienes algun proyecto en mente? Quieres hablar de tecnologia? \nQuieres una mentoria?",
  "footer.contact.text2": "Contactame!",
  "tech.title": "Tecnologias",
  "tech.git.tech": "Implemente un sistema de versionamiento (semver) para que las subidas y el uso de git tags para que los cambios a producción sean mas simples de encontrar y que sean cambiables en caso de problemas.\nCree scripts de automatizacion con git para hacer cambios sobre multiples ramas, por ejemplo borrar multiples ramas que estaban en un repositorio remoto.\nMonitorear las ramas y ultimos cambios dentro de un repositorio.\nImplemente rutinas de ejecucion con Github Actions para hacer pruebas automatizadas, para construir y deployar containers a un servicio de AWS",
  "tech.git.title": "Habilidades Git",
  "tech.mongo.tech": "Uso de todas las funciones de MongoDB para filtrar, modificar y tratar la data.\nCrear una copia de la información para crear un ambiente de pruebas funcional dentro del mismo cluster.\nOptimizar el modelado de la informacion dentro de las colecciones.",
  "tech.mongo.title": "Habilidades Mongo",
  "tech.node.tech": "He trabajado en proyectos de frontend con VanillaJs de los cuales implemente animaciones, validaciones e integraciones con API’s para posteriormente hacer mejoras progresivas.\nHe creado y mantenido proyectos con librerias de JS como Vue y React, de este ultimo implementando librerias como MaterialUI y hooks para formularios con validaciones.\nHice mantenimiento de proyectos backend con Nodejs, tanto un monolito alojado en un servidor en la nube como de un proyecto usando microservicios (lambda) en la nube alojados en AWS.\nRealice integraciones de diferentes frameworks backend como Express y Nestjs.",
  "tech.node.title": "Habilidades Node",
  "tech.ts.tech": "He trabajado en proyectos de frontend con Typescript usando el framework Angular.\nImplemente typescript en proyectos de frontend usando la libreria React.\nHe creado y mantenido proyectos backend con Nodejs usando Typescript como lenguaje de desarrollo para implementar conceptos de SOLID y DDD dentro de un servidor. \nColabore con la creacion de un CLI usando typescript.",
  "tech.ts.title": "Habilidades Typescript",
  "tech.css.tech": "Hice maquetaciones de interfaces con Sass usando Angular, y adaptando diseños al estandar de material.\nCon CSS adapte una guia de estilos para que su aplicacion a distintos componentes y reutilización sea mas simple.\nHice animaciones tanto en Sass como en CSS para darle mas fluidez a interfaces. En un proyecto usando las animaciones de Angular y en otro usando directivas nativas de CSS.",
  "tech.css.title": "Habilidades CSS",
  "tech.sass.tech": "Hice maquetaciones de interfaces con Sass usando Angular, y adaptando diseños al estandar de material.\nCon CSS adapte una guia de estilos para que su aplicacion a distintos componentes y reutilización sea mas simple.\nHice animaciones tanto en Sass como en CSS para darle mas fluidez a interfaces. En un proyecto usando las animaciones de Angular y en otro usando directivas nativas de CSS.",
  "tech.sass.title": "Habilidades SASS",
  "tech.sql.tech": "Manejo avanzado de bases de datos SQL, principalmente en PostgreSQL. Uso de funciones, triggers, indexes, tablas temporales, etc.\nUso de bases de datos de replica (maestro-esclavo) para un sistema altamente concurrente.\nOptimización de querys tanto en legibilidad como en rendimiento. Pase reportes de un año que tardaba mas de 30 segundos a que para la misma información tarde 2 a 3 segundos.\nUso de JSON y JSONB dentro de PostgreSQL para organizar información.",
  "tech.sql.title": "Habilidades SQL",
  "tech.react.tech": "Implemente librerias como MaterialUI, React Router DOM, TailwindUI, React Hook Form y Storybook para hacer una interfaz mas usable, dinamica y mantenible.\nCree hooks personalizados para trabajos especificos en la UI como hover y decomponiendo hooks de librerias como React Form Hook para entender mejor su funcionamiento\nUse hooks propios del lenguaje como useState, useEffect, useContext y demas propios de la libreria.\nHice prueba unitarias con testing library y jest\nUse una arquitectura Clean Code en un proyecto a gran escala usando Nextjs",
  "tech.react.title": "Habilidades React",
  "tech.vue.tech": "Hice una implementación de esta libreria en proyectos legacy que renderizaban pug, para hacerlo mas dinamico y que respondiera a las necesidades del los usuarios de manera mas fluida,\nImplemente componentes reutilizables a la par de VanillaJs para hacer mejoras continuas",
  "tech.vue.title": "Habilidades Vue",
  "tech.angular.tech": "Implemente librerias como RXJS y NGRX para mejorar el rendimiento y la mantenibilidad del proyecto.\nHice mantenimiento de un proyecto con LazyLoading para mejorar la carga y experiencia de usuario.\nTrabaje con librerias como Angular Material y Highcharts para la interfaz de usuario.\nRealice optimizaciones en logica de componentes usando mecanismos propios de Angular como pipes, change detections strategies y demas.\nUse formularios reactivos de manera extensiva para validaciones de multiples campos, de arreglos de formularios, validaciones personalizadas y demas.",
  "tech.angular.title": "Habilidades Angular",
  "tech.aws.tech": "Use servicios de AWS como: Lambda, Cloudwatch, S3, RDS, entre otros.        \nHice monitoreo a los servicios que usabamos con Cloudwatch y programe crons desde la API.        \nMe certifique en fundamentos de AWS desde migracion de un on-premise hasta aplicaciones serverless.        \nUse AWS CDK para crear una rutina practica de provision de arquitectura en la nube reutilizable, mantenible y predecible",
  "tech.aws.title": "Habilidades AWS",
  "tech.figma.tech": "Uso Figma como herramienta de maquetado de pantallas, imagenes, logos, etc.\nY uso Invision como herramienta de maquetado rapido cuando necesito plasmar ideas de una reunion en un wireframe mas visual para darle una idea al stakeholder de como quedaria.\nEste curriculum fue hecho en figma asi como todos los demas componentes visualies exceptuando imagenes.",
  "tech.figma.title": "Habilidades Figma"
}