{
  "main.introduction": "A fullstack Developer with more than 3 years of experience developing software, leading development teams, implementing new fancy technologies and giving techinal advice to IT teams",
  "main.greeting": "¡Hi! I'm",
  "main.button": "Download CV",
  "link.home": "Home",
  "link.contact": "Contact",
  "short.information.1": "I am a software developer by passion, vocation and profession",
  "short.information.2": "I love to learn and share knowledge",
  "short.information.3": "I love working in agile environments where I can grow together with the team",
  "short.information.4": "I like to help people enter the world of development",
  "short.information.5": "I usually write and make videos about technology in my spare time",
  "short.experience.pamer.desc": "\nAs part of the CREEK12 innovation lab in Pamer. I am in charge of: \n      - Developing software both on the server and client sides \n- Making software guided by SOLID principles \n- Being part of the decision-making of the software architecture\n\nWe use a stack of technologies such as\n- NestJS in the Backend \n- NextJS + Tailwind + TS in the Frontend \n- ESlint + Prettier + Jest + Cypress in the Testing \n- AWS CDK + AWS App Runner + AWS S3 \n- Github + Github Actions for version management and CI / CD",
  "short.experience.pamer.title": "Software developer at Pamer",
  "short.experience.pamer.date": "Jul 2021 - Present (4 months)",
  "short.experience.cedhinfo.desc": "\nCAs a technology leader at Cedhinfo. I was in charge of:\n      - Translating stakeholder requirements to the development team\n      - Giving technical guidance regarding development practices for a better product\n      - Mentoring and training to the development team both front and backend\n      - Continuous review of the product goals\n      - And give reports of the progress of the projects\n\n      All handled with a stack of:\n      - Express\n      - Vue\n      - Github",
  "short.experience.cedhinfo.title": "Tech lead at Cedhinfo",
  "short.experience.cedhinfo.date": "Jan 2021 - Jul 2021 (7 months)",
  "short.experience.smiledu.desc": "\nAs part of the Smiledu development team. I was in charge of:\n      - Leading one of the main modules of the project.\n      - Managing a group of people to reach established goals.\n      - Contribute to define the code standards both the Frontend and Backend.\n      - Also I was involved in the process of testing, selection, training and induction of the new members who would enter my area.\n\n      With a stack made up of:\n      - Angular + Angular Material\n      - Express\n      - PostgreSQL\n      - AWS Lambda + AWS RDS + AWS S3",
  "short.experience.smiledu.title": "Fullstack developer at Smiledu",
  "short.experience.smiledu.date": "Dec 2018 - Dec 2020 (2 year and 1 month)",
  "footer.contact": "How can I help you? Contact me!",
  "footer.contact.text": "Do you have any project on mind? Do you want to talk about tech? \nDo you want a mentoring?",
  "footer.contact.text2": "Contact me!"
}